
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДЗ_ДействуетНаОсновании");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.ДЗ_ДействуетНаОсновании) Тогда	
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДЗ_ДействуетНаОсновании);
	
	Иначе		
		Представление = Данные.Наименование;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти