
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередДоговор(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередДоговор(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	КонецЕсли;
	
	// Добавляем поле СогласованнаяСкидка и кнопку РассчетСоСкдкой только для ФориыДокумента.ЗаказПокупателя
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеСогласованнаяСкидкаИКнопкуРассчетСоСкидкойВГруппуШапкаЛево(Форма);
		
		// Назначение обработчика при изменении ПоляВвода.ЭлементДЗ_СогласованнаяСкидка
		Форма.Элементы.ЭлементДЗ_СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ЭлементДЗ_СогласованнаяСкидкаПриИзменении");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма) Экспорт
	
	// Создание Реквизита.ДЗ_КонтактноеЛицо - НЕ ПРИГОДИЛОСЬ!
	//ДобавляемыеРеквизиты = Новый Массив;
	//ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица");
	//
	//РеквизитФормы = Новый РеквизитФормы("РеквизитДЗ_КонтактноеЛицо", ТипРеквизита, "", "Контактное лицо (ДЗ)", Истина); 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем поле КонтактноеЛицо в ГруппаШапкаПраво на Форме
	ПолеВвода = Форма.Элементы.Добавить("ЭлементДЗ_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Заголовок = "Контактное лицо (ДЗ)";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	// Добавляем СвязьПараметровВыбора для поля ДЗ_КонтактноеЛицо
	СвязьПараметров = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	
	МассивСвязей = Новый Массив;
	МассивСвязей.Добавить(СвязьПараметров);
	ФиксМассивСвязей = Новый ФиксированныйМассив(МассивСвязей);
	
	Форма.Элементы.ЭлементДЗ_КонтактноеЛицо.СвязиПараметровВыбора = ФиксМассивСвязей;
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуПередДоговор(Форма) Экспорт
	
	// Создание Реквизита.ДЗ_КонтактноеЛицо - НЕ ПРИГОДИЛОСЬ!
	//ДобавляемыеРеквизиты = Новый Массив;
	//ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица");
	//
	//РеквизитФормы = Новый РеквизитФормы("РеквизитДЗ_КонтактноеЛицо", ТипРеквизита, "", "Контактное лицо (ДЗ)", Истина); 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Вставляем Реквизит в Форме перед др. реквизитом
	ПолеВвода = Форма.Элементы.Вставить("ЭлементДЗ_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Договор);
	ПолеВвода.Заголовок = "Контактное лицо (ДЗ)";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	// Добавляем СвязьПараметровВыбора для поля ДЗ_КонтактноеЛицо
	СвязьПараметров = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	
	МассивСвязей = Новый Массив;
	МассивСвязей.Добавить(СвязьПараметров);
	ФиксМассивСвязей = Новый ФиксированныйМассив(МассивСвязей);
	
	Форма.Элементы.ЭлементДЗ_КонтактноеЛицо.СвязиПараметровВыбора = ФиксМассивСвязей;
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаИКнопкуРассчетСоСкидкойВГруппуШапкаЛево(Форма) Экспорт
	
	// Создание Реквизита.ДЗ_СогласованнаяСкидка - НЕ ПРИГОДИЛОСЬ!
	//ДобавляемыеРеквизиты = Новый Массив;
	//Знак = ДопустимыйЗнак.Неотрицательный;
	//КвалификаторыЧисла = Новый КвалификаторыЧисла(5, 2, Знак);
	//ТипРеквизита = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	//
	//РеквизитФормы = Новый РеквизитФормы("РеквизитДЗ_СогласованнаяСкидка", ТипРеквизита, "", "СогласованнаяСкидка (ДЗ)", Истина); 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем поле СогласованнаяСкидка в ГруппуШапкаЛево на Форме
	ПолеВвода = Форма.Элементы.Добавить("ЭлементДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Заголовок = "Согласованная скидка (ДЗ), %";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	
	// Создание команды РассчетСоСкидкой
	КомандаРассчетСоСкидкой = Форма.Команды.Добавить("ДЗ_РассчетСоСкидкой");
	КомандаРассчетСоСкидкой.Заголовок = "Рассчет со скидкой (ДЗ)";
	КомандаРассчетСоСкидкой.Действие = "ДЗ_ДЗ_РассчетСоСкидкой";
	
	// Добавляем кнопку РассчетСоСкидкой
	КнопкаКоманды = Форма.Элементы.Добавить("КнопкаРассчетСоСкидкой", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	КнопкаКоманды.ИмяКоманды = "ДЗ_РассчетСоСкидкой";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры

#КонецОбласти